{
    "builtins": [
        {
            "name": "package",
            "doc": "This function declares metadata that applies to every rule in the package. It is used at most once within a package (BUILD file).\n\nFor the counterpart that declares metadata applying to every rule in the whole repository, use the <code>repo()</code> function in the <code>REPO.bazel</code> file at the root of your repo. The <code>repo()</code> function takes exactly the same arguments as <code>package()</code>.\n\nThe package() function should be called right after all the load() statements at the top of the file, before any rule.",
            "callable": {
                "params": [
                    {
                        "name": "default_applicable_licenses",
                        "type": "List of Labels",
                        "doc": "Alias for <code>default_package_metadata</code>.",
                        "default_value": "[]",
                        "is_mandatory": false,
                        "is_star_arg": false,
                        "is_star_star_arg": false
                    },
                    {
                        "name": "default_visibility",
                        "type": "List of Labels",
                        "doc": "The default visibility of the rules in this package.\n\nEvery rule in this package has the visibility specified in this attribute, unless otherwise specified in the <code>visibility</code> attribute of the rule. For detailed information about the syntax of this attribute, see the documentation of visibility. The package default visibility does not apply to exports_files, which is public by default.",
                        "default_value": "[]",
                        "is_mandatory": false,
                        "is_star_arg": false,
                        "is_star_star_arg": false
                    },
                    {
                        "name": "default_deprecation",
                        "type": "string",
                        "doc": "Sets the default <code>deprecation</code> message for all rules in this package.",
                        "default_value": "\"\"",
                        "is_mandatory": false,
                        "is_star_arg": false,
                        "is_star_star_arg": false
                    },
                    {
                        "name": "default_package_metadata",
                        "type": "List of Labels",
                        "doc": "Sets a default list of metadata targets which apply to all other targets in the package. These are typically targets related to OSS package and license declarations. See rules_license for examples.",
                        "default_value": "",
                        "is_mandatory": false,
                        "is_star_arg": false,
                        "is_star_star_arg": false
                    },
                    {
                        "name": "default_testonly",
                        "type": "boolean",
                        "doc": "Sets the default <code>testonly</code> property for all rules in this package.\n\nIn packages under <code>javatests</code> the default value is <code>True</code>.",
                        "default_value": "False",
                        "is_mandatory": false,
                        "is_star_arg": false,
                        "is_star_star_arg": false
                    },
                    {
                        "name": "features",
                        "type": "List of strings",
                        "doc": "Sets various flags that affect the semantics of this BUILD file.\n\nThis feature is mainly used by the people working on the build system to tag packages that need some kind of special handling. Do not use this unless explicitly requested by someone working on the build system.",
                        "default_value": "[]",
                        "is_mandatory": false,
                        "is_star_arg": false,
                        "is_star_star_arg": false
                    }
                ],
                "return_type": "None"
            }
        }
    ]
}